config/core/activities-extensions.org
#+title: Activities Extensions
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle activities-extensions.el
#+auto_tangle: y

* Introduction

This module extends the =activities= package with project-aware workflow capabilities
that integrate with projectile and org-roam. It enables creating activities that
automatically manage multiple projects (with git branches/worktrees) and associated
documentation.

** Features

- Multi-project activity management
- Git branch and worktree creation per project
- Automatic org-roam documentation
- Resume with recent project files
- Transient UI for activity creation
- Metadata persistence via activities' etc slot

** Architecture

Activity metadata is stored in the =activities-activity-etc= slot under
=:activity-extensions= key:

#+begin_example elisp
(:activity-extensions
 (:version 1
  :projects ((:path "/path/to/project"
              :name "project-name"
              :branch "feature-branch"
              :worktree nil
              :recent-files ("file1.el" "file2.el")))
  :org-roam (:node-id "abc-123"
             :file "~/org/roam/activity-doc.org"
             :title "Activity Title")
  :settings (:auto-open-recent t)))
#+end_example

** Component Dependencies

This diagram shows how the major components depend on each other:

#+begin_example
┌─────────────────────────────────────────────────────────────────┐
│                    activities-extensions                         │
│                                                                  │
│  ┌──────────────┐      ┌──────────────┐      ┌──────────────┐ │
│  │   Data       │      │  Project     │      │  Org-Roam    │ │
│  │  Management  │◄─────┤ Integration  │      │ Integration  │ │
│  │              │      │              │      │              │ │
│  │ - Metadata   │      │ - Selection  │      │ - Creation   │ │
│  │ - Validation │      │ - Git Ops    │      │ - Templates  │ │
│  └──────┬───────┘      └──────┬───────┘      └──────┬───────┘ │
│         │                     │                     │          │
│         │                     │                     │          │
│         └─────────────┬───────┴─────────────────────┘          │
│                       │                                         │
│              ┌────────▼────────┐                               │
│              │   Lifecycle     │                               │
│              │     Hooks       │                               │
│              │                 │                               │
│              │ - Before Resume │                               │
│              │ - Before Suspend│                               │
│              └────────┬────────┘                               │
│                       │                                         │
│              ┌────────▼────────┐                               │
│              │   Transient     │                               │
│              │      UI         │                               │
│              │                 │                               │
│              │ - Entry Point   │                               │
│              │ - Menu          │                               │
│              │ - Actions       │                               │
│              └─────────────────┘                               │
└──────────────────────────────────────────────────────────────────┘
         │                    │                    │
         │                    │                    │
         ▼                    ▼                    ▼
  ┌──────────┐         ┌──────────┐        ┌──────────┐
  │activities│         │projectile│        │ org-roam │
  │ package  │         │ package  │        │ package  │
  └──────────┘         └──────────┘        └──────────┘
   (required)            (optional)          (optional)
#+end_example

** Data Flow

This shows how data flows through the system during activity creation:

#+begin_example
User Input                    Processing                    Storage
─────────                    ──────────                    ───────

Activity Name  ──────────►  Sanitize/Slugify  ──────────►  activities-ext-
                            (my-feature-work)              current-activity-name
                                   │
                                   │
Project Selection ────────►  Complete-Read   ──────────►  Projects List
(via transient)              Multiple                      ["~/proj1/" "~/proj2/"]
                                   │
                                   │
                            ┌──────▼──────┐
                            │  For Each   │
                            │   Project   │
                            └──────┬──────┘
                                   │
    ┌──────────────────────────────┼──────────────────────────────┐
    │                              │                              │
    ▼                              ▼                              ▼
Git Action          Create Branch/Worktree         Track Recent Files
Prompt              (using sanitized name)          (from recentf)
    │                              │                              │
    ▼                              ▼                              ▼
nothing/            git checkout -b                Filter by project
branch/             OR                              root path
worktree            git worktree add                    │
    │                              │                    │
    └──────────────────────────────┴────────────────────┘
                                   │
                                   ▼
                           Project Metadata
                           (:path "..."
                            :name "..."
                            :branch "..."
                            :worktree "..."
                            :recent-files [...])
                                   │
                                   │
Org-Roam Option ───────────►  Create Document  ──────────►  Org-Roam Node
(--org-roam flag)             (properties-based)            (:node-id "..."
                              with project links             :file "..."
                                   │                         :title "...")
                                   │
                                   ▼
                           ┌───────────────┐
                           │  Store in     │
                           │ Activity Etc  │
                           │   Slot        │
                           └───────┬───────┘
                                   │
                                   ▼
                         activities-activity-etc
                         (:activity-extensions
                          (:version 1
                           :projects [...]
                           :org-roam {...}
                           :settings {...}))
#+end_example

** Creation Workflow

Step-by-step flow when creating a new activity:

#+begin_example
START: User presses C-x C-a C-e
  │
  ▼
┌────────────────────────────────┐
│ activities-ext-create          │
│ (Entry function)               │
└────────────────┬───────────────┘
                 │
                 ▼
          ┌─────────────┐
          │ Prompt for  │
          │   Name      │
          └──────┬──────┘
                 │
                 ▼
          ┌──────────────┐
          │  Sanitize/   │
          │   Slugify    │
          └──────┬───────┘
                 │
                 ▼
          ┌──────────────┐
          │ Store name   │
          │ in variable  │
          └──────┬───────┘
                 │
                 ▼
┌────────────────────────────────┐
│ activities-ext-create-transient│
│ (Open transient menu)          │
└────────────────┬───────────────┘
                 │
        ┌────────┴─────────┐
        │                  │
        ▼                  ▼
  ┌─────────┐      ┌────────────┐
  │ Select  │      │ Toggle     │
  │Projects │      │ --org-roam │
  │  (-p)   │      │    (-d)    │
  └────┬────┘      └──────┬─────┘
       │                  │
       │                  │
       └─────────┬────────┘
                 │
                 ▼ User presses RET
┌────────────────────────────────┐
│ activities-ext--create-action  │
└────────────────┬───────────────┘
                 │
         ┌───────┴──────────────────┐
         │                          │
         ▼                          │
  ┌─────────────┐                  │
  │ FOR EACH    │                  │
  │  PROJECT    │◄─────────────────┘
  └──────┬──────┘
         │
         ▼
  ┌──────────────┐
  │ Git Action   │
  │   Prompt     │
  │ (branch/     │
  │  worktree/   │
  │  nothing)    │
  └──────┬───────┘
         │
         ├─── nothing ───► Skip git ops
         │
         ├─── branch ────► git checkout -b <sanitized-name>
         │
         └─── worktree ──► git worktree add ~/proj-<sanitized-name>
         │
         ▼
  ┌──────────────┐
  │ Build Project│
  │  Metadata    │
  └──────┬───────┘
         │
         ▼
  LOOP DONE
         │
         ▼
  ┌──────────────┐
  │ Create       │
  │ Org-Roam Doc?│
  └──────┬───────┘
         │
         ├─── Yes ───► Generate template
         │             Create node
         │             Store metadata
         │
         └─── No ────► Skip
         │
         ▼
  ┌──────────────┐
  │ Call         │
  │activities-new│
  └──────┬───────┘
         │
         ▼
  ┌──────────────┐
  │ Store all    │
  │ metadata in  │
  │ activity-etc │
  └──────┬───────┘
         │
         ▼
  ┌──────────────┐
  │ Open org-roam│
  │ doc if       │
  │ created      │
  └──────┬───────┘
         │
         ▼
       DONE
#+end_example

** Resume Workflow

Flow when resuming an existing activity:

#+begin_example
START: User resumes activity
  │
  ▼
┌────────────────────────────────┐
│ activities-before-resume-      │
│ functions hook fires           │
└────────────────┬───────────────┘
                 │
                 ▼
┌────────────────────────────────┐
│ activities-ext--before-resume  │
└────────────────┬───────────────┘
                 │
                 ▼
          ┌──────────────┐
          │ Get metadata │
          │ from activity│
          │ etc slot     │
          └──────┬───────┘
                 │
                 ├─── No metadata? ──► EXIT
                 │
                 ▼
          ┌──────────────┐
          │ Extract      │
          │ :projects    │
          │ :org-roam    │
          │ :settings    │
          └──────┬───────┘
                 │
         ┌───────┴──────┐
         │              │
         ▼              ▼
  ┌─────────────┐  ┌──────────────┐
  │ Open        │  │ FOR EACH     │
  │ org-roam    │  │  PROJECT     │
  │ document    │  └──────┬───────┘
  │ in current  │         │
  │ window      │         ▼
  └─────────────┘  ┌──────────────┐
                   │ Get recent   │
                   │ files from   │
                   │ metadata     │
                   └──────┬───────┘
                          │
                          ▼
                   ┌──────────────┐
                   │ Open each    │
                   │ file (skip   │
                   │ if missing)  │
                   └──────┬───────┘
                          │
                          ▼
                       LOOP DONE
                          │
                          ▼
                   ┌──────────────┐
                   │ Restore      │
                   │ window state │
                   │ (activities  │
                   │  handles)    │
                   └──────────────┘
                          │
                          ▼
                        DONE
#+end_example

** Key Design Decisions

*** Metadata Storage
Store all extension data in =activities-activity-etc= slot under =:activity-extensions=
key. This avoids modifying the activities package and keeps extensions modular.

*** Sanitized Naming
The activity name is sanitized once using =activities-ext--slugify= (converts "My
Feature Work" to "my-feature-work") and used consistently for all git operations.
This provides a unified naming scheme across all projects.

*** Optional Dependencies
Projectile and org-roam are optional - the module checks for their availability at
runtime with =fboundp=. This allows the module to function (with reduced features)
even if these packages aren't installed.

*** Resume Hook Integration
Uses =activities-before-resume-functions= hook to automatically restore project
files and documentation when resuming an activity. No manual intervention needed.

*** Properties-Based Documents
Org-roam documents use properties drawers for project information, enabling
programmatic queries via org-element API rather than parsing markdown-style text.

* Lexical Binding

Enable lexical binding for proper closures and variable scoping.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src

* Dependencies

Require necessary packages that this module depends on.

Note: projectile and org-roam are optional - we use runtime checks with fboundp.
Activities and transient are required since this module extends them.

#+begin_src emacs-lisp
(require 'activities)
(require 'transient)
(require 'cl-lib)

;; Optional dependencies - loaded later in init sequence
(require 'projectile nil t)  ; noerror - checked at runtime
(require 'org-roam nil t)    ; noerror - checked at runtime
#+end_src

* Configuration

** Custom Group

Define a custom group for activities-extensions settings.

#+begin_src emacs-lisp
(defgroup activities-extensions nil
  "Extensions for the activities package with project and documentation support."
  :group 'activities
  :prefix "activities-ext-")
#+end_src

