config/core/activities-extensions.el
;; -*- lexical-binding: t; -*-

(require 'activities)
(require 'transient)
(require 'cl-lib)

;; Optional dependencies - loaded later in init sequence
(require 'projectile nil t)  ; noerror - checked at runtime
(require 'org-roam nil t)    ; noerror - checked at runtime

(defgroup activities-extensions nil
  "Extensions for the activities package with project and documentation support."
  :group 'activities
  :prefix "activities-ext-")
