config/core/activities-extensions.el

(defcustom activities-ext-auto-open-recent t
  "Automatically open recent project files when resuming activities."
  :type 'boolean
  :group 'activities-extensions)

(defcustom activities-ext-recent-files-limit 5
  "Maximum number of recent files to track per project."
  :type 'integer
  :group 'activities-extensions)

(defcustom activities-ext-worktree-directory "~/"
  "Directory where git worktrees are created.
Worktrees are named as: PROJECT-NAME-BRANCH-NAME"
  :type 'directory
  :group 'activities-extensions)

(defvar activities-ext--current-activity-name nil
  "Temporary storage for activity name during creation flow.
Set by `activities-ext-create' and used by transient actions.")

(defcustom activities-ext-prompt-for-org-roam t
  "Prompt to create org-roam document when creating activities."
  :type 'boolean
  :group 'activities-extensions)

(defcustom activities-ext-org-roam-subdirectory ""
  "Subdirectory within org-roam-directory for activity documents.
Empty string means root of org-roam-directory."
  :type 'string
  :group 'activities-extensions)

(defun activities-ext--get-metadata (activity)
  "Get extension metadata from ACTIVITY.
Returns the plist stored under :activity-extensions key,
or nil if no metadata exists."
  (when activity
    (plist-get (activities-activity-etc activity) :activity-extensions)))

(defun activities-ext--set-metadata (activity metadata)
  "Set extension METADATA for ACTIVITY.
METADATA should be a plist with :version, :projects, :org-roam, :settings keys."
  (when activity
    (setf (activities-activity-etc activity)
          (plist-put (activities-activity-etc activity)
                     :activity-extensions
                     metadata))))

(defconst activities-ext--metadata-version 1
  "Current version of the metadata schema.")

(defun activities-ext--create-metadata (&optional projects org-roam settings)
  "Create new metadata plist with optional PROJECTS, ORG-ROAM, and SETTINGS.
Returns a plist with :version, :projects, :org-roam, :settings keys."
  (list :version activities-ext--metadata-version
        :projects (or projects nil)
        :org-roam (or org-roam nil)
        :settings (or settings (list :auto-open-recent activities-ext-auto-open-recent))))

(defun activities-ext--slugify (string)
  "Convert STRING to URL-friendly slug.
Converts to lowercase, replaces spaces and special characters with hyphens."
  (when string
    (let ((slug (downcase string)))
      ;; Replace spaces and underscores with hyphens
      (setq slug (replace-regexp-in-string "[ _]+" "-" slug))
      ;; Remove non-alphanumeric except hyphens
      (setq slug (replace-regexp-in-string "[^a-z0-9-]" "" slug))
      ;; Remove leading/trailing hyphens
      (setq slug (replace-regexp-in-string "^-+\\|-+$" "" slug))
      ;; Collapse multiple hyphens
      (setq slug (replace-regexp-in-string "-+" "-" slug))
      slug)))

(defun activities-ext--validate-project (project-plist)
  "Validate PROJECT-PLIST data.
Returns plist with :valid t/nil, :exists t/nil, :error string.
PROJECT-PLIST should have :path key at minimum."
  (let* ((path (plist-get project-plist :path))
         (worktree (plist-get project-plist :worktree))
         (effective-path (or worktree path)))
    (cond
     ((not path)
      (list :valid nil :exists nil :error "No path specified"))

     ((not (file-exists-p effective-path))
      (list :valid nil :exists nil
            :error (format "Directory does not exist: %s" effective-path)))

     ((not (file-directory-p effective-path))
      (list :valid nil :exists t
            :error (format "Path is not a directory: %s" effective-path)))

     ((not (file-readable-p effective-path))
      (list :valid nil :exists t
            :error (format "Directory not readable: %s" effective-path)))

     (t
      (list :valid t :exists t :error nil)))))

(defun activities-ext--select-projects ()
  "Select multiple projects using completing-read-multiple.
Returns list of project paths (absolute directory paths)."
  (let ((projects (projectile-known-projects)))
    (when projects
      (completing-read-multiple
       "Select projects (comma-separated): "
       projects
       nil  ; predicate
       t    ; require-match
       ))))

(defun activities-ext--prompt-git-action (project-path branch-name)
  "Prompt user for git action on PROJECT-PATH using BRANCH-NAME.
Returns plist with :action, :branch, :worktree, :created keys.
:action can be 'branch, 'worktree, or nil.
BRANCH-NAME is the sanitized activity name to use for branch/worktree."
  (let* ((project-name (file-name-nondirectory
                       (directory-file-name project-path)))
         (action (intern
                  (completing-read
                   (format "Git action for %s (will use: %s): " project-name branch-name)
                   '("nothing" "branch" "worktree")
                   nil t nil nil "nothing")))
         (action (if (eq action 'nothing) nil action))
         (result (list :action action :branch nil :worktree nil :created nil)))

    (message "DEBUG: action=%S for project=%s with branch=%s" action project-name branch-name)

    (when action
      ;; Use the provided branch-name instead of prompting
      (plist-put result :branch branch-name)

      (cond
       ((eq action 'branch)
        (message "DEBUG: Creating branch %s in %s" branch-name project-path)
        (let ((created (activities-ext--create-branch project-path branch-name)))
          (plist-put result :created created)))

       ((eq action 'worktree)
        (message "DEBUG: Creating worktree for branch %s in %s" branch-name project-path)
        (let ((worktree-path (activities-ext--create-worktree project-path branch-name)))
          (when worktree-path
            (plist-put result :worktree worktree-path)
            (plist-put result :created t))))))

    (message "DEBUG: git result=%S" result)
    result))

(defun activities-ext--create-branch (project-path branch-name)
  "Create git branch BRANCH-NAME in PROJECT-PATH.
Returns t if created, nil if already exists or on error."
  (let ((default-directory project-path))
    (condition-case err
        (progn
          (if (zerop (call-process "git" nil nil nil "checkout" "-b" branch-name))
              (progn
                (message "Created branch %s in %s" branch-name project-path)
                t)
            (message "Branch creation failed in %s" project-path)
            nil))
      (error
       (message "Error creating branch: %s" (error-message-string err))
       nil))))

(defun activities-ext--create-worktree (project-path branch-name)
