config/core/activities-extensions.el
  "Create git worktree for BRANCH-NAME in PROJECT-PATH.
Returns worktree path or nil on failure.
Worktree is created in `activities-ext-worktree-directory' with format:
PROJECT-NAME-BRANCH-NAME"
  (let* ((default-directory project-path)
         (project-name (file-name-nondirectory
                       (directory-file-name project-path)))
         (worktree-name (format "%s-%s" project-name branch-name))
         (worktree-path (expand-file-name worktree-name
                                         activities-ext-worktree-directory)))
    (condition-case err
        (progn
          (if (zerop (call-process "git" nil nil nil "worktree" "add"
                                  worktree-path "-b" branch-name))
              (progn
                (message "Created worktree at %s" worktree-path)
                worktree-path)
            (message "Worktree creation failed for %s" project-path)
            nil))
      (error
       (message "Error creating worktree: %s" (error-message-string err))
       nil))))

(defun activities-ext--get-recent-project-files (project-path limit)
  "Get recent files from recentf for PROJECT-PATH.
Returns list of up to LIMIT file paths that belong to the project."
  (when (bound-and-true-p recentf-list)
    (let ((project-root (file-truename (expand-file-name project-path)))
          (recent-files nil)
          (count 0))
      (cl-dolist (file recentf-list)
        (when (and (< count limit)
                  (file-exists-p file)
                  (string-prefix-p project-root (file-truename file)))
          (push file recent-files)
          (cl-incf count)))
      (nreverse recent-files))))

(defun activities-ext--open-recent-files (file-list)
  "Open files in FILE-LIST, gracefully handling missing files.
Reports missing files but continues opening available ones."
  (let ((opened 0)
        (missing 0))
    (dolist (file file-list)
      (if (file-exists-p file)
          (progn
            (find-file file)
            (cl-incf opened))
        (cl-incf missing)))
    (when (> missing 0)
      (message "Opened %d files (%d missing)" opened missing))))

(defun activities-ext--create-org-roam-doc (activity-name &optional projects)
  "Create org-roam document for ACTIVITY-NAME.
Optional PROJECTS is a list of project plists to include in document.
Returns plist with :node-id, :file, :title, :created keys."
  (let* ((slug (format "%s-%s"
                      (format-time-string "%Y%m%d%H%M%S")
                      (activities-ext--slugify activity-name)))
         (filename (concat slug ".org"))
         (subdirectory (if (string-empty-p activities-ext-org-roam-subdirectory)
                          ""
                        (file-name-as-directory activities-ext-org-roam-subdirectory)))
         (full-subdir (expand-file-name subdirectory org-roam-directory))
         (file-path (expand-file-name filename full-subdir))
         (title (format "Activity: %s" activity-name)))

    ;; Ensure subdirectory exists
    (unless (file-directory-p full-subdir)
      (make-directory full-subdir t))

    ;; Create the file with content
    (with-temp-file file-path
      (insert (format "#+title: %s\n" title))
      (insert (format "#+filetags: :activity:%s:\n\n" (activities-ext--slugify activity-name)))
      (insert (activities-ext--default-template activity-name projects)))

    ;; Update org-roam database
    (when (fboundp 'org-roam-db-update-file)
      (org-roam-db-update-file file-path))

    ;; Get node ID
    (let ((node-id nil))
      (when (fboundp 'org-roam-node-from-file)
        (let ((node (org-roam-node-from-file file-path)))
          (when node
            (setq node-id (org-roam-node-id node)))))

      (list :node-id node-id
            :file file-path
            :title title
            :created t))))

(defun activities-ext--default-template (activity-name projects)
  "Generate default template content for ACTIVITY-NAME with PROJECTS.
PROJECTS is a list of project plists with :path, :name, :branch, :worktree keys.
Each project is stored as an org heading with properties for programmatic access."
  (concat
   "* Overview\n\n"
   (format "Activity: %s\n\n" activity-name)
   "* Projects\n\n"
   (if projects
       (mapconcat
        (lambda (proj)
          (let* ((name (or (plist-get proj :name) "Unknown"))
                 (path (plist-get proj :path))
                 (branch (plist-get proj :branch))
                 (worktree (plist-get proj :worktree))
                 (effective-path (or worktree path)))
            (concat
             (format "** Project: %s\n" name)
             ":PROPERTIES:\n"
             (format ":PROJECT_PATH: %s\n" path)
             (format ":PROJECT_NAME: %s\n" name)
             (if branch
                 (format ":PROJECT_BRANCH: %s\n" branch)
               "")
             (if worktree
                 (format ":PROJECT_WORKTREE: %s\n" worktree)
               "")
             ":END:\n\n"
             (format "[[file:%s][Open %s]]%s\n\n"
                    effective-path
                    name
                    (if branch (format " (branch: %s)" branch) "")))))
        projects
        "")
     "No projects associated.\n\n")
   "* Tasks\n\n"
   "** TODO Task 1\n"
   "** TODO Task 2\n\n"
   "* Notes\n\n"
   "* Session Log\n\n"
   (format "** Session: %s\n\n"
          (format-time-string "%Y-%m-%d %H:%M"))))

(defun activities-ext--open-org-roam-doc (org-roam-plist)
  "Open org-roam document from ORG-ROAM-PLIST metadata.
ORG-ROAM-PLIST should have :file key.
Warns if file doesn't exist but doesn't error."
  (when org-roam-plist
    (let ((file (plist-get org-roam-plist :file)))
      (if (and file (file-exists-p file))
          (find-file file)
        (when file
          (warn "Activity document not found: %s" file))))))

(defun activities-ext--before-resume (activity)
  "Hook called before resuming ACTIVITY.
Opens org-roam document and recent project files based on settings."
  (when-let ((ext-data (activities-ext--get-metadata activity)))
    (let ((projects (plist-get ext-data :projects))
          (org-roam-data (plist-get ext-data :org-roam))
          (settings (plist-get ext-data :settings)))

      ;; Open org-roam document in current window
      (when org-roam-data
        (activities-ext--open-org-roam-doc org-roam-data))

      ;; Open recent files if enabled
      (when (plist-get settings :auto-open-recent)
        (dolist (project projects)
          (when-let ((files (plist-get project :recent-files)))
            (activities-ext--open-recent-files files)))))))

(defun activities-ext--before-suspend (activity)
  "Hook called before suspending ACTIVITY.
Updates recent files list for all projects."
  (when-let ((ext-data (activities-ext--get-metadata activity)))
    (let* ((projects (plist-get ext-data :projects))
           (updated-projects
            (mapcar
             (lambda (proj)
               (let* ((path (plist-get proj :path))
                      (recent (when path
                               (activities-ext--get-recent-project-files
                                path
                                activities-ext-recent-files-limit))))
                 ;; Update or add recent-files key
                 (if recent
                     (plist-put (copy-sequence proj) :recent-files recent)
                   proj)))
             projects)))
      ;; Update metadata with new recent files
      (plist-put ext-data :projects updated-projects)
      (activities-ext--set-metadata activity ext-data))))
