config/core/activities-extensions.el

;; Register resume hook
(add-hook 'activities-before-resume-functions #'activities-ext--before-resume)

;; Note: activities package doesn't have a before-suspend-functions hook,
;; so we use advice to add our suspend handler
(advice-add 'activities-suspend :before
            (lambda (activity)
              (activities-ext--before-suspend activity)))

(defvar activities-ext--transient-state nil
  "State for the activities extensions transient menu.
Plist with keys: :name, :projects, :create-org-roam.")

(defclass activities-ext--infix-projects (transient-infix)
  ((projects :initarg :projects :initform nil))
  "Transient infix for multi-selecting projects.")

(cl-defmethod transient-infix-read ((obj activities-ext--infix-projects))
  "Read projects using multi-select completion."
  (let ((selected (activities-ext--select-projects)))
    (oset obj projects selected)
    ;; Return the list - it will be added to transient args
    selected))

(cl-defmethod transient-format-value ((obj activities-ext--infix-projects))
  "Format projects for display in transient menu."
  (let ((projects (oref obj projects)))
    (if projects
        (propertize (format "%d project%s selected"
                           (length projects)
                           (if (> (length projects) 1) "s" ""))
                   'face 'transient-value)
      (propertize "none" 'face 'transient-inactive-value))))

(defun activities-ext-create ()
  "Create an extended activity with projects and documentation.
Prompts for activity name first, then opens transient for project selection."
  (interactive)
  (let ((name (read-string "Activity name: ")))
    (when (string-empty-p (string-trim name))
      (user-error "Activity name cannot be empty"))
    (setq activities-ext--current-activity-name name)
    (activities-ext-create-transient)))

(transient-define-prefix activities-ext-create-transient ()
  "Select projects and options for new activity.
Activity name has already been captured."
  ["Configuration"
   ("-p" "Select projects" activities-ext--select-projects-infix)]
  ["Documentation"
   ("-d" "Create org-roam document" "--org-roam")]
  ["Actions"
   ("RET" "Create Activity" activities-ext--create-action)
   ("q" "Cancel" transient-quit-one)])

(transient-define-infix activities-ext--select-projects-infix ()
  "Infix for selecting multiple projects."
  :class 'activities-ext--infix-projects
  :key "-p"
  :description "Select projects"
  :argument "--projects=")

(defun activities-ext--create-action (&optional args)
  "Create activity with transient ARGS.
Main action function called from transient menu.
Uses the activity name stored in `activities-ext--current-activity-name'."
  (interactive (list (transient-args 'activities-ext-create-transient)))

  ;; Get activity name from stored variable
  (let* ((activity-name activities-ext--current-activity-name)
         (sanitized-name (activities-ext--slugify activity-name))
         ;; Find the list element in args (that's the projects)
         (project-paths (cl-find-if #'listp args))
         (create-org-roam (member "--org-roam" args))
         (project-metadata nil)
         (org-roam-data nil))

    ;; Debug output
    (message "DEBUG: args=%S" args)
    (message "DEBUG: activity-name=%s sanitized=%s" activity-name sanitized-name)
    (message "DEBUG: project-paths=%S" project-paths)

    (unless activity-name
      (user-error "No activity name provided"))

    ;; Process projects if selected
    (when project-paths
      (dolist (project-path project-paths)
        (let* ((project-path (string-trim project-path))
               (project-name (file-name-nondirectory
                            (directory-file-name project-path)))
               ;; Pass sanitized name to git action prompt
               (git-result (activities-ext--prompt-git-action project-path sanitized-name))
               (proj-plist (list :path project-path
                                :name project-name
                                :branch (plist-get git-result :branch)
                                :worktree (plist-get git-result :worktree)
                                :recent-files nil)))
          (push proj-plist project-metadata))))

    (setq project-metadata (nreverse project-metadata))

    ;; Create org-roam document if requested
    (when create-org-roam
      (setq org-roam-data
            (activities-ext--create-org-roam-doc activity-name project-metadata)))

    ;; Create the activity using activities-new
    (activities-new activity-name)

    ;; Get the newly created activity and store metadata
    (when-let ((activity (map-elt activities-activities activity-name)))
      (let ((metadata (activities-ext--create-metadata
                      project-metadata
                      org-roam-data
                      (list :auto-open-recent activities-ext-auto-open-recent))))
        (activities-ext--set-metadata activity metadata)))

    ;; Open org-roam document if created
    (when org-roam-data
      (activities-ext--open-org-roam-doc org-roam-data))

    (message "Created extended activity: %s" activity-name)))

(defun activities-ext--current-activity ()
  "Get the currently active activity.
Returns nil if no activity is active."
  (when (bound-and-true-p activities--current)
    activities--current))

(defun activities-ext-show-projects ()
  "Show projects for current activity in *Activities Projects* buffer."
  (interactive)
  (if-let* ((activity (activities-ext--current-activity))
            (ext-data (activities-ext--get-metadata activity))
            (projects (plist-get ext-data :projects)))
      (let ((buf (get-buffer-create "*Activities Projects*")))
        (with-current-buffer buf
          (erase-buffer)
          (insert (format "Projects for Activity: %s\n\n"
                         (activities-activity-name activity)))
          (dolist (proj projects)
            (let ((name (plist-get proj :name))
                  (path (plist-get proj :path))
                  (branch (plist-get proj :branch))
                  (worktree (plist-get proj :worktree))
                  (validation (activities-ext--validate-project proj)))
              (insert (format "* %s\n" name))
              (insert (format "  Path: %s\n"
                             (or worktree path)))
              (when branch
                (insert (format "  Branch: %s\n" branch)))
              (insert (format "  Status: %s\n"
                             (if (plist-get validation :valid)
                                 "✓ Valid"
                               (format "✗ %s" (plist-get validation :error)))))
              (insert "\n")))
          (goto-char (point-min))
          (view-mode 1))
        (pop-to-buffer buf))
    (message "No projects in current activity")))

(defun activities-ext-open-document ()
  "Open org-roam document for current activity."
  (interactive)
  (if-let* ((activity (activities-ext--current-activity))
            (ext-data (activities-ext--get-metadata activity))
            (org-roam-data (plist-get ext-data :org-roam)))
      (activities-ext--open-org-roam-doc org-roam-data)
    (message "No org-roam document for current activity")))

(defun activities-ext-validate ()
