config/core/activities-extensions.org
** Validate Activity

Validate all projects and files for the current activity.

#+begin_src emacs-lisp
(defun activities-ext-validate ()
  "Validate current activity's projects and files.
Reports status in minibuffer and creates detailed report buffer."
  (interactive)
  (if-let* ((activity (activities-ext--current-activity))
            (ext-data (activities-ext--get-metadata activity))
            (projects (plist-get ext-data :projects)))
      (let ((results (mapcar #'activities-ext--validate-project projects))
            (valid-count 0)
            (total-count (length projects)))
        (dolist (result results)
          (when (plist-get result :valid)
            (cl-incf valid-count)))
        (if (= valid-count total-count)
            (message "All %d projects valid ✓" total-count)
          (message "Warning: %d/%d projects valid" valid-count total-count)
          (activities-ext-show-projects)))
    (message "No projects in current activity")))
#+end_src

** Add Project

Add a project to the current activity.

#+begin_src emacs-lisp
(defun activities-ext-add-project ()
  "Add a project to the current activity.
Uses the sanitized activity name for branch/worktree creation."
  (interactive)
  (if-let ((activity (activities-ext--current-activity)))
      (let* ((activity-name (activities-activity-name activity))
             (sanitized-name (activities-ext--slugify activity-name))
             (project-path (completing-read "Select project to add: "
                                           (projectile-known-projects)
                                           nil t))
             (project-name (file-name-nondirectory
                           (directory-file-name project-path)))
             ;; Pass sanitized activity name for branch/worktree
             (git-result (activities-ext--prompt-git-action project-path sanitized-name))
             (proj-plist (list :path project-path
                             :name project-name
                             :branch (plist-get git-result :branch)
                             :worktree (plist-get git-result :worktree)
                             :recent-files nil))
             (ext-data (or (activities-ext--get-metadata activity)
                          (activities-ext--create-metadata)))
             (projects (plist-get ext-data :projects)))

        ;; Add new project to list
        (setq projects (append projects (list proj-plist)))
        (plist-put ext-data :projects projects)
        (activities-ext--set-metadata activity ext-data)

        (message "Added project %s to activity with branch %s" project-name sanitized-name))
    (message "No active activity")))
#+end_src

** Keybindings

Define keybindings for activities-extensions commands.

#+begin_src emacs-lisp
;; Use global keybindings since activities uses :bind in use-package
(global-set-key (kbd "C-x C-a C-e") 'activities-ext-create)
(global-set-key (kbd "C-x C-a p") 'activities-ext-show-projects)
(global-set-key (kbd "C-x C-a d") 'activities-ext-open-document)
(global-set-key (kbd "C-x C-a v") 'activities-ext-validate)
(global-set-key (kbd "C-x C-a +") 'activities-ext-add-project)
#+end_src

* Module Initialization

Provide the module for loading.

#+begin_src emacs-lisp
(provide 'activities-extensions)
;;; activities-extensions.el ends here
#+end_src

* Usage

** Basic Usage

*** Creating Extended Activities

Use ~C-x C-a C-e~ to open the transient menu for creating extended activities
(will be implemented in Phase 5).

*** Viewing Projects

Use ~C-x C-a p~ to view projects associated with the current activity
(will be implemented in Phase 6).

*** Opening Documentation

Use ~C-x C-a d~ to open the org-roam document for the current activity
(will be implemented in Phase 6).

** Configuration Examples

*** Custom Worktree Directory

#+begin_example elisp
(setq activities-ext-worktree-directory "~/worktrees/")
#+end_example

*** Increase Recent Files Limit

#+begin_example elisp
(setq activities-ext-recent-files-limit 10)
#+end_example

*** Use Org-Roam Subdirectory

#+begin_example elisp
(setq activities-ext-org-roam-subdirectory "activities")
#+end_example
